Ginger/GingerCoreNETUnitTest/TestResources/XML/createPaymentRequest2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:soap.embus.sbc.com" xmlns:urn1="urn:PamFacadePackage.pam.idl.eia.sbc.com">
   <soapenv:Header>
      <urn:MessageHeader>
         <urn:MessageTag>?</urn:MessageTag>
         <!--Optional:-->
         <urn:ApplicationID>?</urn:ApplicationID>
         <!--Optional:-->
         <urn:MessageID>?</urn:MessageID>
         <!--Optional:-->
         <urn:CorrelationID>?</urn:CorrelationID>
         <!--Optional:-->
         <urn:ConversationKey>?</urn:ConversationKey>
         <!--Optional:-->
         <urn:LoggingKey>?</urn:LoggingKey>
         <!--Optional:-->
         <urn:ResponseMessageExpiration>?</urn:ResponseMessageExpiration>
      </urn:MessageHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:com.sbc.eia.idl.pam.PamFacadePackage._createPayment4RequestBISMsg>
         <context>
            <properties>
               <item>
                  <tag field="BisContextApplication">Application</tag>
                  <value field="BisContextApplicationValue">CreatePayment</value>
               </item>
               <item>
                  <tag field="BisContextUserId">UserID</tag>
                  <value field="BisContextUserIdValue">value</value>
               </item>
               <item>
                  <tag field="BisContextApplication">Application</tag>
                  <value field="BisContextApplicationValue">ApplicationValue</value>
               </item>
               <item>
                  <tag field="BisContextProperty.REQUEST_ID">RequestId</tag>
                  <value field="BisContextProperty.REQUEST_IDValue">value</value>
               </item>
            </properties>
         </context>
         <sourceSystem>opop</sourceSystem>
         <sourceLocation>cc</sourceLocation>
         <sourceUser>usersource</sourceUser>
         <sourceBusinessUnit/>
         <locationId>opop</locationId>
         <paymentRequest>
            <paymentItems>
               <item>
                  <itemAmount>
                     <quantity>1</quantity>
                     <monetaryUnit>UNITEDSTATES_DOLLAR</monetaryUnit>
                  </itemAmount>
                  <paymentItemCategory>pmpm</paymentItemCategory>
                  <submittedAccountId>123456</submittedAccountId>
                  <billingSystemInformation>
                     <provider>thisisstring</provider>
                     <system>C</system>
                     <systemDivision>1111</systemDivision>
                  </billingSystemInformation>
                  <invoiceNumber/>
                  <paymentOption>
                     <code>thisisString</code>
                  </paymentOption>
                  <receiptTime>
                     <eiaDate>
                        <year>2018</year>
                        <month>09</month>
                        <day>18</day>
                     </eiaDate>
                     <hour>1</hour>
                     <minute>1</minute>
                     <second>1</second>
                     <milliSeconds>1</milliSeconds>
                     <tCOffset>1</tCOffset>
                  </receiptTime>
                  <preAssignedServiceHandle>
                     <value/>
                     <kind>preTTT</kind>
                  </preAssignedServiceHandle>
                  <customerHandle>
                     <value>value</value>
                     <kind>customer</kind>
                  </customerHandle>
                  <properties>
                     <item>
                        <tig>thisisString</tig>
                        <value>thisisString</value>
                     </item>
                  </properties>
                  <productID/>
                  <customerAddress>
                     <unfieldedAddress>
                        <addressLines>
                           <item/>
                        </addressLines>
                        <unitType/>
                        <unitValue/>
                     </unfieldedAddress>
                  </customerAddress>
               </item>
            </paymentItems>
            <paymentMethods>
               <item>
                  <creditCard>
                     <creditCardData>
                        <method>card</method>
                        <cardNumber>12345678</cardNumber>
                        <expirationDate>
                           <year>2018</year>
                           <month>01</month>
                           <day>30</day>
                        </expirationDate>
                        <creditCardType/>
                        <payeeName>payname</payeeName>
                        <address>
                           <unfieldedAddress>
                              <addressLines>
                                 <item/>
                              </addressLines>
                              <postalCode>12345</postalCode>
                           </unfieldedAddress>
                        </address>
                        <cardVerification>123</cardVerification>
                        <cardVerificationIndicator>0</cardVerificationIndicator>
                        <pIN/>
                        <scanLine/>
                     </creditCardData>
                     <amount>
                        <quantity>1</quantity>
                        <monetaryUnit>UNITEDSTATES_DOLLAR</monetaryUnit>
                     </amount>
                     <merchantId>123456</merchantId>
                     <authorizationCode/>
                     <itemDetails>
                        <item>
                           <taxAmount>
                              <quantity>0.00</quantity>
                              <monetaryUnit>UNITEDSTATES_DOLLAR</monetaryUnit>
                           </taxAmount>
                           <discountAmount>
                              <quantity>0.00</quantity>
                              <monetaryUnit>UNITEDSTATES_DOLLAR</monetaryUnit>
                           </discountAmount>
                           <customerReferenceNumber/>
                           <itemAmount>
                              <quantity>0.00</quantity>
                              <monetaryUnit>UNITEDSTATES_DOLLAR</monetaryUnit>
                           </itemAmount>
                        </item>
                     </itemDetails>
                     <merchantOrderNumber>11111111</merchantOrderNumber>
                     <properties>
                        <item>
                           <value/>
                        </item>
                     </properties>
                  </creditCard>
               </item>
            </paymentMethods>
         </paymentRequest>
         <convenienceFee>Y</convenienceFee>
         <customerAgreement>Agree</customerAgreement>
      </urn1:com.sbc.eia.idl.pam.PamFacadePackage._createPayment4RequestBISMsg>
   </soapenv:Body>
</soapenv:Envelope>